benchmark/results/optimistic_vu10.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/optimistic.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 25s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 02/10 VUs, 38 complete and 0 interrupted iterations
default   [   4% ] 02/10 VUs  01.0s/25.0s

running (02.0s), 04/10 VUs, 96 complete and 0 interrupted iterations
default   [   8% ] 04/10 VUs  02.0s/25.0s

running (03.0s), 06/10 VUs, 157 complete and 0 interrupted iterations
default   [  12% ] 06/10 VUs  03.0s/25.0s

running (04.0s), 08/10 VUs, 224 complete and 0 interrupted iterations
default   [  16% ] 08/10 VUs  04.0s/25.0s

running (05.0s), 09/10 VUs, 299 complete and 0 interrupted iterations
default   [  20% ] 09/10 VUs  05.0s/25.0s

running (06.0s), 10/10 VUs, 383 complete and 0 interrupted iterations
default   [  24% ] 10/10 VUs  06.0s/25.0s

running (07.0s), 10/10 VUs, 464 complete and 0 interrupted iterations
default   [  28% ] 10/10 VUs  07.0s/25.0s

running (08.0s), 10/10 VUs, 550 complete and 0 interrupted iterations
default   [  32% ] 10/10 VUs  08.0s/25.0s

running (09.0s), 10/10 VUs, 630 complete and 0 interrupted iterations
default   [  36% ] 10/10 VUs  09.0s/25.0s

running (10.0s), 10/10 VUs, 714 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  10.0s/25.0s

running (11.0s), 10/10 VUs, 786 complete and 0 interrupted iterations
default   [  44% ] 10/10 VUs  11.0s/25.0s

running (12.0s), 10/10 VUs, 876 complete and 0 interrupted iterations
default   [  48% ] 10/10 VUs  12.0s/25.0s

running (13.0s), 10/10 VUs, 959 complete and 0 interrupted iterations
default   [  52% ] 10/10 VUs  13.0s/25.0s

running (14.0s), 10/10 VUs, 1045 complete and 0 interrupted iterations
default   [  56% ] 10/10 VUs  14.0s/25.0s

running (15.0s), 10/10 VUs, 1133 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  15.0s/25.0s

running (16.0s), 10/10 VUs, 1224 complete and 0 interrupted iterations
default   [  64% ] 10/10 VUs  16.0s/25.0s

running (17.0s), 10/10 VUs, 1305 complete and 0 interrupted iterations
default   [  68% ] 10/10 VUs  17.0s/25.0s

running (18.0s), 10/10 VUs, 1398 complete and 0 interrupted iterations
default   [  72% ] 10/10 VUs  18.0s/25.0s

running (19.0s), 10/10 VUs, 1492 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  19.0s/25.0s

running (20.0s), 10/10 VUs, 1574 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  20.0s/25.0s

running (21.0s), 10/10 VUs, 1663 complete and 0 interrupted iterations
default   [  84% ] 10/10 VUs  21.0s/25.0s

running (22.0s), 10/10 VUs, 1746 complete and 0 interrupted iterations
default   [  88% ] 10/10 VUs  22.0s/25.0s

running (23.0s), 10/10 VUs, 1836 complete and 0 interrupted iterations
default   [  92% ] 10/10 VUs  23.0s/25.0s

running (24.0s), 10/10 VUs, 1924 complete and 0 interrupted iterations
default   [  96% ] 10/10 VUs  24.0s/25.0s

running (25.0s), 10/10 VUs, 2012 complete and 0 interrupted iterations
default   [ 100% ] 10/10 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 2022   80.537376/s
    checks_succeeded...: 68.29% 1381 out of 2022
    checks_failed......: 31.70% 641 out of 2022

    ✗ status is 200
      ↳  68% — ✓ 1381 / ✗ 641

    CUSTOM
    optimistic_attempt_count.......: avg=2.883284 min=1       med=2       p(90)=5        p(95)=5        p(99)=5        max=5       

    HTTP
    http_req_duration..............: avg=111.35ms min=1.26ms  med=78.17ms p(90)=232.36ms p(95)=242.15ms p(99)=295.08ms max=349.17ms
      { expected_response:true }...: avg=57.95ms  min=1.26ms  med=21.44ms p(90)=163ms    p(95)=212.77ms p(99)=234.35ms max=305.7ms 
    http_req_failed................: 31.70% 641 out of 2022
    http_reqs......................: 2022   80.537376/s

    EXECUTION
    iteration_duration.............: avg=111.59ms min=13.36ms med=78.39ms p(90)=232.54ms p(95)=242.35ms p(99)=295.27ms max=349.36ms
    iterations.....................: 2022   80.537376/s
    vus............................: 10     min=2           max=10
    vus_max........................: 10     min=10          max=10

    NETWORK
    data_received..................: 426 kB 17 kB/s
    data_sent......................: 488 kB 19 kB/s



running (25.1s), 00/10 VUs, 2022 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  25s