benchmark/results/optimistic_vu100.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/optimistic.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 25s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 020/100 VUs, 75 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  01.0s/25.0s

running (02.0s), 040/100 VUs, 204 complete and 0 interrupted iterations
default   [   8% ] 040/100 VUs  02.0s/25.0s

running (03.0s), 060/100 VUs, 327 complete and 0 interrupted iterations
default   [  12% ] 060/100 VUs  03.0s/25.0s

running (04.0s), 080/100 VUs, 451 complete and 0 interrupted iterations
default   [  16% ] 080/100 VUs  04.0s/25.0s

running (05.0s), 099/100 VUs, 582 complete and 0 interrupted iterations
default   [  20% ] 099/100 VUs  05.0s/25.0s

running (06.0s), 100/100 VUs, 714 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  06.0s/25.0s

running (07.0s), 100/100 VUs, 858 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  07.0s/25.0s

running (08.0s), 100/100 VUs, 998 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  08.0s/25.0s

running (09.0s), 100/100 VUs, 1134 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  09.0s/25.0s

running (10.0s), 100/100 VUs, 1274 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  10.0s/25.0s

running (11.0s), 100/100 VUs, 1414 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  11.0s/25.0s

running (12.0s), 100/100 VUs, 1560 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  12.0s/25.0s

running (13.0s), 100/100 VUs, 1702 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  13.0s/25.0s

running (14.0s), 100/100 VUs, 1833 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  14.0s/25.0s

running (15.0s), 100/100 VUs, 1968 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  15.0s/25.0s

running (16.0s), 100/100 VUs, 2100 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  16.0s/25.0s

running (17.0s), 100/100 VUs, 2235 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  17.0s/25.0s

running (18.0s), 100/100 VUs, 2378 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  18.0s/25.0s

running (19.0s), 100/100 VUs, 2522 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  19.0s/25.0s

running (20.0s), 100/100 VUs, 2649 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  20.0s/25.0s

running (21.0s), 100/100 VUs, 2775 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  21.0s/25.0s

running (22.0s), 100/100 VUs, 2912 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  22.0s/25.0s

running (23.0s), 100/100 VUs, 2956 complete and 0 interrupted iterations
default   [  92% ] 100/100 VUs  23.0s/25.0s

running (24.0s), 100/100 VUs, 3045 complete and 0 interrupted iterations
default   [  96% ] 100/100 VUs  24.0s/25.0s

running (25.0s), 100/100 VUs, 3183 complete and 0 interrupted iterations
default   [ 100% ] 100/100 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 3285   129.25658/s
    checks_succeeded...: 12.72% 418 out of 3285
    checks_failed......: 87.27% 2867 out of 3285

    ✗ status is 200
      ↳  12% — ✓ 418 / ✗ 2867

    CUSTOM
    optimistic_attempt_count.......: avg=4.714155 min=1       med=5        p(90)=5        p(95)=5        p(99)=5     max=5    

    HTTP
    http_req_duration..............: avg=691.73ms min=14.34ms med=739.83ms p(90)=823.55ms p(95)=866.87ms p(99)=1.72s max=1.82s
      { expected_response:true }...: avg=351.74ms min=14.34ms med=267.96ms p(90)=743.93ms p(95)=788.37ms p(99)=1.51s max=1.78s
    http_req_failed................: 87.27% 2867 out of 3285
    http_reqs......................: 3285   129.25658/s

    EXECUTION
    iteration_duration.............: avg=692.65ms min=14.49ms med=740.79ms p(90)=824.14ms p(95)=867.04ms p(99)=1.72s max=1.82s
    iterations.....................: 3285   129.25658/s
    vus............................: 100    min=20           max=100
    vus_max........................: 100    min=100          max=100

    NETWORK
    data_received..................: 688 kB 27 kB/s
    data_sent......................: 793 kB 31 kB/s



running (25.4s), 000/100 VUs, 3285 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  25s