benchmark/results/optimistic_vu200.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/optimistic.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 55s max duration (incl. graceful stop):
              * default: Up to 200 looping VUs for 25s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 039/200 VUs, 93 complete and 0 interrupted iterations
default   [   4% ] 039/200 VUs  01.0s/25.0s

running (02.0s), 079/200 VUs, 213 complete and 0 interrupted iterations
default   [   8% ] 079/200 VUs  02.0s/25.0s

running (03.0s), 119/200 VUs, 337 complete and 0 interrupted iterations
default   [  12% ] 119/200 VUs  03.0s/25.0s

running (04.0s), 159/200 VUs, 464 complete and 0 interrupted iterations
default   [  16% ] 159/200 VUs  04.0s/25.0s

running (05.0s), 199/200 VUs, 585 complete and 0 interrupted iterations
default   [  20% ] 199/200 VUs  05.0s/25.0s

running (06.0s), 200/200 VUs, 707 complete and 0 interrupted iterations
default   [  24% ] 200/200 VUs  06.0s/25.0s

running (07.0s), 200/200 VUs, 826 complete and 0 interrupted iterations
default   [  28% ] 200/200 VUs  07.0s/25.0s

running (08.0s), 200/200 VUs, 963 complete and 0 interrupted iterations
default   [  32% ] 200/200 VUs  08.0s/25.0s

running (09.0s), 200/200 VUs, 1020 complete and 0 interrupted iterations
default   [  36% ] 200/200 VUs  09.0s/25.0s

running (10.0s), 200/200 VUs, 1121 complete and 0 interrupted iterations
default   [  40% ] 200/200 VUs  10.0s/25.0s

running (11.0s), 200/200 VUs, 1263 complete and 0 interrupted iterations
default   [  44% ] 200/200 VUs  11.0s/25.0s

running (12.0s), 200/200 VUs, 1394 complete and 0 interrupted iterations
default   [  48% ] 200/200 VUs  12.0s/25.0s

running (13.0s), 200/200 VUs, 1519 complete and 0 interrupted iterations
default   [  52% ] 200/200 VUs  13.0s/25.0s

running (14.0s), 200/200 VUs, 1661 complete and 0 interrupted iterations
default   [  56% ] 200/200 VUs  14.0s/25.0s

running (15.0s), 200/200 VUs, 1807 complete and 0 interrupted iterations
default   [  60% ] 200/200 VUs  15.0s/25.0s

running (16.0s), 200/200 VUs, 1908 complete and 0 interrupted iterations
default   [  64% ] 200/200 VUs  16.0s/25.0s

running (17.0s), 200/200 VUs, 1958 complete and 0 interrupted iterations
default   [  68% ] 200/200 VUs  17.0s/25.0s

running (18.0s), 200/200 VUs, 2094 complete and 0 interrupted iterations
default   [  72% ] 200/200 VUs  18.0s/25.0s

running (19.0s), 200/200 VUs, 2227 complete and 0 interrupted iterations
default   [  76% ] 200/200 VUs  19.0s/25.0s

running (20.0s), 200/200 VUs, 2360 complete and 0 interrupted iterations
default   [  80% ] 200/200 VUs  20.0s/25.0s

running (21.0s), 200/200 VUs, 2494 complete and 0 interrupted iterations
default   [  84% ] 200/200 VUs  21.0s/25.0s

running (22.0s), 200/200 VUs, 2624 complete and 0 interrupted iterations
default   [  88% ] 200/200 VUs  22.0s/25.0s

running (23.0s), 200/200 VUs, 2657 complete and 0 interrupted iterations
default   [  92% ] 200/200 VUs  23.0s/25.0s

running (24.0s), 200/200 VUs, 2781 complete and 0 interrupted iterations
default   [  96% ] 200/200 VUs  24.0s/25.0s

running (25.0s), 200/200 VUs, 2917 complete and 0 interrupted iterations
default   [ 100% ] 200/200 VUs  25.0s/25.0s


  █ TOTAL RESULTS 

    checks_total.......: 3120   120.909054/s
    checks_succeeded...: 11.53% 360 out of 3120
    checks_failed......: 88.46% 2760 out of 3120

    ✗ status is 200
      ↳  11% — ✓ 360 / ✗ 2760

    CUSTOM
    optimistic_attempt_count.......: avg=4.754167 min=1       med=5        p(90)=5     p(95)=5     p(99)=5     max=5    

    HTTP
    http_req_duration..............: avg=1.47s    min=16.3ms  med=1.52s    p(90)=2.36s p(95)=2.4s  p(99)=2.47s max=2.67s
      { expected_response:true }...: avg=793.39ms min=16.3ms  med=660.74ms p(90)=1.59s p(95)=1.76s p(99)=2.38s max=2.49s
    http_req_failed................: 88.46% 2760 out of 3120
    http_reqs......................: 3120   120.909054/s

    EXECUTION
    iteration_duration.............: avg=1.47s    min=16.55ms med=1.53s    p(90)=2.36s p(95)=2.4s  p(99)=2.47s max=2.67s
    iterations.....................: 3120   120.909054/s
    vus............................: 200    min=40           max=200
    vus_max........................: 200    min=200          max=200

    NETWORK
    data_received..................: 653 kB 25 kB/s
    data_sent......................: 753 kB 29 kB/s



running (25.8s), 000/200 VUs, 3120 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/200 VUs  25s